src/cf/Documents/АктВзаимозачета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>АктВзаимозачета</Name>
			<BasedOn>
				<xr:Item>Document.АктВзаимозачета</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НДСНачисленный</xr:Item>
				<xr:Item>AccumulationRegister.НДСВключенныйВСтоимость</xr:Item>
				<xr:Item>AccountingRegister.Финансовый</xr:Item>
				<xr:Item>AccumulationRegister.НДСПредъявленныйРеализация0</xr:Item>
				<xr:Item>AccumulationRegister.НДСПредъявленный</xr:Item>
				<xr:Item>AccumulationRegister.НДСРасчетыСПокупателями</xr:Item>
				<xr:Item>AccumulationRegister.РасходыПриУСН</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.НДСПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.НДСРасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.НДСРеализация0</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.КнигаУчетаДоходовИРасходов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентДебитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентКредитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТОП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТиповыеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТОП_ДолгКредитораНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТиповыеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТОП_ДолгДебитораНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТиповыеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подвид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подвиды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнийАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДолгКредитора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРасчетовСКонтрагентом</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтражениеВзаиморасчетовПрочее</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтражениеРеализацииТоваровУслугНДС</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.КомиссияОтчетПродажиКомитенту</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
								<v8:Type>cfg:DocumentRef.ОплатаОтПокупателяПлатежнойКартой</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтражениеПоступленияТоваровУслугНДС</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.КомиссияОтчетПродажиКомиссионера</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.АктВзаимозачета</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРегл</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДоговораКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторПеречислений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДолгДебитора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРасчетовСКонтрагентом</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтражениеВзаиморасчетовПрочее</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтражениеРеализацииТоваровУслугНДС</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.КомиссияОтчетПродажиКомитенту</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
								<v8:Type>cfg:DocumentRef.ОплатаОтПокупателяПлатежнойКартой</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтражениеПоступленияТоваровУслугНДС</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.КомиссияОтчетПродажиКомиссионера</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.АктВзаимозачета</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРегл</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУСН</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДоговораКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторПеречислений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/АктВзаимозачета/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
//Управление печатными формами

Процедура СтруктураПечатныхФорм(Структура) Экспорт
	Структура.Вставить("АктВзаимозачета", "Акт взаимозачета");
	Структура.Вставить("УведомлениеОЗачете", "Уведомление о зачете");
	Структура.Вставить("БухгалтерскаяСправка", "Бухгалтерская справка");	
КонецПроцедуры

Функция ИнициализацияМакета(СтруктураПараметров, стрМакет)
	Если СтруктураПараметров.Свойство("Макет") Тогда
		Возврат СтруктураПараметров.Макет;
	КонецЕсли;
	Макет=СтруктураПараметров.МакетШаблон;
	Если Макет=Неопределено Тогда
		Если Метаданные.ОбщиеМакеты.Найти(стрМакет)=Неопределено Тогда
			Макет=ПолучитьМакет(стрМакет);
		Иначе
			Макет=ПолучитьОбщийМакет(стрМакет);
		КонецЕсли;
	КонецЕсли;
	Возврат Макет;
КонецФункции

Функция ПолучитьДанныеДокумента(СсылкаНаОбъект)
	стрРеквизиты="";
	Для каждого мдРеквизит Из СсылкаНаОбъект.Метаданные().Реквизиты Цикл
		стрРеквизиты=стрРеквизиты+","+Символы.ПС+мдРеквизит.Имя;
	КонецЦикла;	

	Запрос=Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("ТекущийДокумент", СсылкаНаОбъект);
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Дата,
	|	Номер,
	|	Проведен,
	|	Организация.НаименованиеПолное Как ОрганизацияНаименованиеПолное,
	|	КонтрагентДебитор.НаименованиеПолное Как КонтрагентДебиторНаименованиеПолное,
	|	КонтрагентКредитор.НаименованиеПолное Как КонтрагентКредиторНаименованиеПолное
	|	"+стрРеквизиты+",
	|	ДолгКредитора Как ДолгКредитора,
	|	ДолгДебитора Как ДолгДебитора
	|ИЗ
	|	Документ.АктВзаимозачета КАК ИсточникДанных
	|ГДЕ
	|	ИсточникДанных.Ссылка = &ТекущийДокумент
	|";
	
	#Если НаСервере Тогда
	Запрос.Выполнить();
	#КонецЕсли

	Возврат Запрос.Результат.Выгрузить();
КонецФункции 	

Функция ПолучитьДанныеДокумента1(СсылкаНаОбъект)
	стрРеквизиты="";
	Для каждого мдРеквизит Из СсылкаНаОбъект.Метаданные().Реквизиты Цикл
		стрРеквизиты=стрРеквизиты+","+Символы.ПС+мдРеквизит.Имя;
	КонецЦикла;	

	Запрос=Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("ТекущийДокумент", СсылкаНаОбъект);
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Дата,
	|	Номер,
	|	Проведен,
	|	Организация.НаименованиеПолное Как ОрганизацияНаименованиеПолное,
	|	КонтрагентДебитор.НаименованиеПолное Как КонтрагентДебиторНаименованиеПолное,
	|	КонтрагентКредитор.НаименованиеПолное Как КонтрагентКредиторНаименованиеПолное
	|	"+стрРеквизиты+",
	|	ДолгКредитора Как ДолгКредитора,
	|	ДолгДебитора Как ДолгДебитора
	|ИЗ
	|	Документ.АктВзаимозачета КАК ИсточникДанных
	|ГДЕ
	|	ИсточникДанных.Ссылка = &ТекущийДокумент
	|";
	
	#Если НаСервере Тогда
	Запрос.Выполнить();
	#КонецЕсли
	РеквизитыШапки=Запрос.Результат.Выбрать();
	РеквизитыШапки.Следующий();
	Возврат РеквизитыШапки;
КонецФункции 	

Функция Печать_АктВзаимозачета(СтруктураПараметров)
	ДанныеДокумента=ПолучитьДанныеДокумента1(СтруктураПараметров.СсылкаНаОбъект);
	
	ТабДокумент=Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АктВзаимозачета_АктВзаимозачета";
	
	Макет=ИнициализацияМакета(СтруктураПараметров, "АктВзаимозачета");
	
	ОбластьМакета=Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Номер=ДанныеДокумента.Номер;
	ОбластьМакета.Параметры.Дата=ДанныеДокумента.Дата;
	ОбластьМакета.Параметры.Организация=ДанныеДокумента.ОрганизацияНаименованиеПолное;
	Руководители = ПечатныеФормыСервер.ОтветственныеЛицаОрганизации(ДанныеДокумента.Организация, ДанныеДокумента.Дата, СтруктураПараметров.СсылкаНаОбъект);
	ОбластьМакета.Параметры.Директор=Руководители.Руководитель;
	ТабДокумент.Вывести(ОбластьМакета);
	
	АктТрехсторонний=?((НЕ ДанныеДокумента.КонтрагентКредитор.Пустая()) И (НЕ ДанныеДокумента.КонтрагентДебитор.Пустая()) И (ДанныеДокумента.КонтрагентКредитор<>ДанныеДокумента.КонтрагентДебитор),Истина, Ложь);
	НомерСтороны="2";
	Если АктТрехсторонний Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаКлиент");
		ОбластьМакета.Параметры.Клиент=ДанныеДокумента.КонтрагентДебиторНаименованиеПолное;
		ОбластьМакета.Параметры.НомерСтороны=НомерСтороны;
		ТабДокумент.Вывести(ОбластьМакета);
		НомерСтороны="3";
	КонецЕсли;	
	ОбластьМакета=Макет.ПолучитьОбласть("ШапкаКлиент");
	ОбластьМакета.Параметры.Клиент=ДанныеДокумента.КонтрагентКредиторНаименованиеПолное;
	ОбластьМакета.Параметры.НомерСтороны=НомерСтороны;
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета=Макет.ПолучитьОбласть("Раздел1");
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета=Макет.ПолучитьОбласть("ШапкаТЧ");
	ТабДокумент.Вывести(ОбластьМакета);
	ИтогоСуммаДокумента=0; ИтогоСуммаЗачета=0; ИтогоСуммаНДС=0;
	ДолгДебитора=ДанныеДокумента.ДолгДебитора.Выгрузить();
	Для Каждого СтрокаПродажи ИЗ ДолгДебитора Цикл
		ОбластьМакета=Макет.ПолучитьОбласть("СтрокаТЧ");
		ОбластьМакета.Параметры.стрДокумент=?(ЗначениеЗаполнено(СтрокаПродажи.ДокументРасчетовСКонтрагентом),Строка(СтрокаПродажи.ДокументРасчетовСКонтрагентом)+" по договору "+Строка(СтрокаПродажи.ДоговорКонтрагента),СтрокаПродажи.ДоговорКонтрагента);
		СуммаДокумента=?(ЗначениеЗаполнено(СтрокаПродажи.ДокументРасчетовСКонтрагентом), СтрокаПродажи.ДокументРасчетовСКонтрагентом.СуммаДокумента, СтрокаПродажи.СуммаРегл);
		ОбластьМакета.Параметры.СуммаДокумента=СуммаДокумента;
		ОбластьМакета.Параметры.СуммаЗачета=СтрокаПродажи.СуммаРегл;
		ОбластьМакета.Параметры.СуммаНДС=СтрокаПродажи.СуммаНДС;
		ИтогоСуммаДокумента=ИтогоСуммаДокумента+СуммаДокумента;
		ИтогоСуммаЗачета=ИтогоСуммаЗачета+СтрокаПродажи.СуммаРегл;
		ИтогоСуммаНДС=ИтогоСуммаНДС+СтрокаПродажи.СуммаНДС;
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;
	ОбластьМакета=Макет.ПолучитьОбласть("ПодвалТЧ");
	ОбластьМакета.Параметры.ИтогоСуммаДокумента=ИтогоСуммаДокумента;
	ОбластьМакета.Параметры.ИтогоСуммаЗачетаПрописью=ОбщегоНазначения.СформироватьСуммуПрописью(ИтогоСуммаЗачета, МодульВалютногоУчета.ПолучитьВалюту("Бух"));
	ОбластьМакета.Параметры.ИтогоСуммаЗачета=ИтогоСуммаЗачета;
	ОбластьМакета.Параметры.ИтогоСуммаНДС=ИтогоСуммаНДС;
	ТабДокумент.Вывести(ОбластьМакета);
	
	Если АктТрехсторонний Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПустая");
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаСторона");
	ОбластьМакета.Параметры.НомерСтороны=НомерСтороны;
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТЧ");
	ТабДокумент.Вывести(ОбластьМакета);
	ИтогоСуммаДокумента=0; ИтогоСуммаЗачета=0; ИтогоСуммаНДС=0;
	
	ДолгКредитора=ДанныеДокумента.ДолгКредитора.Выгрузить();
	Для Каждого СтрокаПродажи ИЗ ДолгКредитора Цикл
		ОбластьМакета=Макет.ПолучитьОбласть("СтрокаТЧ");
		ОбластьМакета.Параметры.стрДокумент=?(ЗначениеЗаполнено(СтрокаПродажи.ДокументРасчетовСКонтрагентом),Строка(СтрокаПродажи.ДокументРасчетовСКонтрагентом)+" по договору "+Строка(СтрокаПродажи.ДоговорКонтрагента),СтрокаПродажи.ДоговорКонтрагента);
		СуммаДокумента=?(ЗначениеЗаполнено(СтрокаПродажи.ДокументРасчетовСКонтрагентом),СтрокаПродажи.ДокументРасчетовСКонтрагентом.СуммаДокумента,СтрокаПродажи.Сумма);
		ОбластьМакета.Параметры.СуммаДокумента=СуммаДокумента;
		ОбластьМакета.Параметры.СуммаЗачета=СтрокаПродажи.СуммаРегл;
		ОбластьМакета.Параметры.СуммаНДС=СтрокаПродажи.СуммаНДС;
		ИтогоСуммаДокумента=ИтогоСуммаДокумента+СуммаДокумента;
		ИтогоСуммаЗачета=ИтогоСуммаЗачета+СтрокаПродажи.СуммаРегл;
		ИтогоСуммаНДС=ИтогоСуммаНДС+СтрокаПродажи.СуммаНДС;
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;
	ОбластьМакета=Макет.ПолучитьОбласть("ПодвалТЧ");
	ОбластьМакета.Параметры.ИтогоСуммаДокумента=ИтогоСуммаДокумента;
	ОбластьМакета.Параметры.ИтогоСуммаЗачетаПрописью=ОбщегоНазначения.СформироватьСуммуПрописью(ИтогоСуммаЗачета, МодульВалютногоУчета.ПолучитьВалюту("Бух"));
	ОбластьМакета.Параметры.ИтогоСуммаЗачета=ИтогоСуммаЗачета;
	ОбластьМакета.Параметры.ИтогоСуммаНДС=ИтогоСуммаНДС;
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	СведенияОбОрганизации = КонтактнаяИнформацияСервер.СведенияОЮрФизЛице(ДанныеДокумента.Организация, ДанныеДокумента.Дата);
	СведенияОКонтрагенте  = КонтактнаяИнформацияСервер.СведенияОЮрФизЛице(ДанныеДокумента.КонтрагентКредитор, ДанныеДокумента.Дата);
	
	ОбластьМакета.Параметры.НомерСтороны=НомерСтороны;
	ОбластьМакета.Параметры.Организация=СокрЛП(ДанныеДокумента.ОрганизацияНаименованиеПолное);
	ОбластьМакета.Параметры.ОрганизацияИНН=Строка(СведенияОбОрганизации.ИНН);
	ОбластьМакета.Параметры.ФактицескийАдресОрганизация=Строка(СведенияОбОрганизации.ФактическийАдрес);
	ОбластьМакета.Параметры.ТелефонОрганизация=Строка(СведенияОбОрганизации.Телефоны);
	
	ОбластьМакета.Параметры.Контрагент=СокрЛП(ДанныеДокумента.КонтрагентКредиторНаименованиеПолное);
	ОбластьМакета.Параметры.КонтрагентИНН=Строка(СведенияОКонтрагенте.ИНН);
	ОбластьМакета.Параметры.ФактическийАдресКонтрагент=Строка(СведенияОКонтрагенте.ФактическийАдрес);
	ОбластьМакета.Параметры.ТелефонКонтрагент=Строка(СведенияОКонтрагенте.Телефоны);
	
	ОбластьМакета.Параметры.Руководитель=Руководители.Руководитель;
	ОбластьМакета.Параметры.ГлавныйБухгалтер=Руководители.ГлавныйБухгалтер;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	Если АктТрехсторонний Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалСторона3");
		СведенияОКонтрагенте  = КонтактнаяИнформацияСервер.СведенияОЮрФизЛице(ДанныеДокумента.КонтрагентДебитор, ДанныеДокумента.Дата);
		
		ОбластьМакета.Параметры.Контрагент=СокрЛП(ДанныеДокумента.КонтрагентДебиторНаименованиеПолное);
		ОбластьМакета.Параметры.КонтрагентИНН=Строка(СведенияОКонтрагенте.ИНН);
		ОбластьМакета.Параметры.ФактическийАдресКонтрагент=Строка(СведенияОКонтрагенте.ФактическийАдрес);
		ОбластьМакета.Параметры.ТелефонКонтрагент=Строка(СведенияОКонтрагенте.Телефоны);
		
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЕсли;
	
	Возврат ТабДокумент;
КонецФункции

Функция Печать_УведомлениеОЗачете_ПараметрыПечати(СтруктураПараметров)
	СсылкаНаОбъект=СтруктураПараметров.СсылкаНаОбъект;
	тзДанные=ПолучитьДанныеДокумента(СсылкаНаОбъект);
	ПараметрыПечати = Новый Структура;
	Для каждого СтрокаКоллекции Из тзДанные.Колонки Цикл
		ПараметрыПечати.Вставить(СтрокаКоллекции.Имя, тзДанные[0][СтрокаКоллекции.Имя]);
	КонецЦикла;
	СведенияОбОрганизации = КонтактнаяИнформацияСервер.СведенияОЮрФизЛице(ПараметрыПечати.Организация, ПараметрыПечати.Дата);
	СведенияОКонтрагенте  = КонтактнаяИнформацияСервер.СведенияОЮрФизЛице(ПараметрыПечати.КонтрагентКредитор, ПараметрыПечати.Дата);
	
	ПараметрыПечати.Организация=СокрЛП(ПараметрыПечати.ОрганизацияНаименованиеПолное);
	ПараметрыПечати.Вставить("ОрганизацияИНН",Строка(СведенияОбОрганизации.ИНН));
	ПараметрыПечати.Вставить("ФактицескийАдресОрганизация",Строка(СведенияОбОрганизации.ФактическийАдрес));
	ПараметрыПечати.Вставить("ТелефонОрганизация",Строка(СведенияОбОрганизации.Телефоны));
	ПараметрыПечати.Вставить("Контрагент",СокрЛП(ПараметрыПечати.КонтрагентКредиторНаименованиеПолное));
	ПараметрыПечати.Вставить("КонтрагентИНН",Строка(СведенияОКонтрагенте.ИНН));
	ПараметрыПечати.Вставить("ФактическийАдресКонтрагент",Строка(СведенияОКонтрагенте.ФактическийАдрес));
	ПараметрыПечати.Вставить("ТелефонКонтрагент",Строка(СведенияОКонтрагенте.Телефоны));
	ПараметрыПечати.Вставить("СуммаПогашения",ПараметрыПечати.СуммаДокумента);
	ПараметрыПечати.Вставить("СуммаПогашенияПрописью",ОбщегоНазначения.СформироватьСуммуПрописью(ПараметрыПечати.СуммаДокумента, МодульВалютногоУчета.ПолучитьВалюту("Бух")));
	ИтогоСуммаДокументаПокупки=0; ИтогоСуммаЗачетаПокупки=0; ИтогоСуммаНДСПокупки=0;
	ИтогоСуммаДокументаПродажи=0; ИтогоСуммаЗачетаПродажи=0; ИтогоСуммаНДСПродажи=0;

	ПараметрыПечати.ДолгДебитора.Колонки.Добавить("СуммаДокументаПродажи");
	ПараметрыПечати.ДолгДебитора.Колонки.Добавить("СуммаЗачетаПродажи");
	ПараметрыПечати.ДолгДебитора.Колонки.Добавить("СуммаНДСПродажи");
	ПараметрыПечати.ДолгДебитора.Колонки.Добавить("стрДокументПродажи");
	Для Каждого СтрокаКоллекции ИЗ ПараметрыПечати.ДолгДебитора Цикл
		стрДокументПродажи=?(ЗначениеЗаполнено(СтрокаКоллекции.ДокументРасчетовСКонтрагентом),Строка(СтрокаКоллекции.ДокументРасчетовСКонтрагентом)+" по договору "+Строка(СтрокаКоллекции.ДоговорКонтрагента),СтрокаКоллекции.ДоговорКонтрагента);
		СуммаДокумента=?(ЗначениеЗаполнено(СтрокаКоллекции.ДокументРасчетовСКонтрагентом),СтрокаКоллекции.ДокументРасчетовСКонтрагентом.СуммаДокумента,СтрокаКоллекции.СуммаРегл);
		СуммаЗачета=СтрокаКоллекции.СуммаРегл;
		СтрокаКоллекции.СуммаДокументаПродажи=СуммаДокумента;
		СтрокаКоллекции.СуммаЗачетаПродажи=СуммаЗачета;
		СтрокаКоллекции.СуммаНДСПродажи=СтрокаКоллекции.СуммаНДС;
		СтрокаКоллекции.стрДокументПродажи=стрДокументПродажи;
		ИтогоСуммаДокументаПродажи=ИтогоСуммаДокументаПродажи+СуммаДокумента;
		ИтогоСуммаЗачетаПродажи=ИтогоСуммаЗачетаПродажи+СуммаЗачета;
		ИтогоСуммаНДСПродажи=ИтогоСуммаНДСПродажи+СтрокаКоллекции.СуммаНДС;
	КонецЦикла;	
	ПараметрыПечати.Вставить("ИтогоСуммаДокументаПродажи",ИтогоСуммаДокументаПродажи);
	ПараметрыПечати.Вставить("ИтогоСуммаЗачетаПродажи",ИтогоСуммаЗачетаПродажи);
	ПараметрыПечати.Вставить("ИтогоСуммаНДСПродажи",ИтогоСуммаНДСПродажи);
	
	ПараметрыПечати.ДолгКредитора.Колонки.Добавить("СуммаДокументаПокупки");
	ПараметрыПечати.ДолгКредитора.Колонки.Добавить("СуммаЗачетаПокупки");
	ПараметрыПечати.ДолгКредитора.Колонки.Добавить("СуммаНДСПокупки");
	ПараметрыПечати.ДолгКредитора.Колонки.Добавить("стрДокументПокупки");
	Для Каждого СтрокаКоллекции ИЗ ПараметрыПечати.ДолгКредитора Цикл
		стрДокументПокупки=?(ЗначениеЗаполнено(СтрокаКоллекции.ДокументРасчетовСКонтрагентом),Строка(СтрокаКоллекции.ДокументРасчетовСКонтрагентом)+" по договору "+Строка(СтрокаКоллекции.ДоговорКонтрагента),СтрокаКоллекции.ДоговорКонтрагента);
		СуммаДокумента=?(ЗначениеЗаполнено(СтрокаКоллекции.ДокументРасчетовСКонтрагентом),СтрокаКоллекции.ДокументРасчетовСКонтрагентом.СуммаДокумента,СтрокаКоллекции.СуммаРегл);
		СуммаЗачета=СтрокаКоллекции.СуммаРегл;
		СтрокаКоллекции.СуммаДокументаПокупки=СуммаДокумента;
		СтрокаКоллекции.СуммаЗачетаПокупки=СуммаЗачета;
		СтрокаКоллекции.СуммаНДСПокупки=СтрокаКоллекции.СуммаНДС;
		СтрокаКоллекции.стрДокументПокупки=стрДокументПокупки;
		ИтогоСуммаДокументаПокупки=ИтогоСуммаДокументаПокупки+СуммаДокумента;
		ИтогоСуммаЗачетаПокупки=ИтогоСуммаЗачетаПокупки+СуммаЗачета;
		ИтогоСуммаНДСПокупки=ИтогоСуммаНДСПокупки+СтрокаКоллекции.СуммаНДС;
	КонецЦикла;

	ПараметрыПечати.Вставить("ИтогоСуммаДокументаПокупки",ИтогоСуммаДокументаПокупки);
	ПараметрыПечати.Вставить("ИтогоСуммаЗачетаПокупки",ИтогоСуммаЗачетаПокупки);
	ПараметрыПечати.Вставить("ИтогоСуммаНДСПокупки",ИтогоСуммаНДСПокупки);
	
	Руководители = ПечатныеФормыСервер.ОтветственныеЛицаОрганизации(ПараметрыПечати.Организация, ПараметрыПечати.Дата, СсылкаНаОбъект);
	ПараметрыПечати.Вставить("Руководитель",Руководители.Руководитель);
	ПараметрыПечати.Вставить("ГлавныйБухгалтер",Руководители.ГлавныйБухгалтер);

	Если СтруктураПараметров.Свойство("МодульПечати") Тогда
		стрТекстМодуля=СтруктураПараметров.МодульПечати.ПараметрыПечатнойФормы.ТекстМодуля;
		Если Не ПустаяСтрока(стрТекстМодуля) Тогда Выполнить(стрТекстМодуля); КонецЕсли;
	КонецЕсли;	
	
	Возврат ПараметрыПечати;
КонецФункции

Функция Печать_УведомлениеОЗачете(СтруктураПараметров)
	ПараметрыПечати=Печать_УведомлениеОЗачете_ПараметрыПечати(СтруктураПараметров);
	Если ПараметрыПечати.Свойство("Отказ") И ПараметрыПечати.Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;

	ТабДокумент=Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АктВзаимозачета_УведомлениеОЗачете";
	
	Макет=ИнициализацияМакета(СтруктураПараметров, "УведомлениеОЗачете");
	
	ОбластьМакета=Макет.ПолучитьОбласть("Шапка");
	ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ПараметрыПечати);
	ТабДокумент.Вывести(ОбластьМакета);
	
	КоличествоСтрок=?(ПараметрыПечати.ДолгДебитора.Количество()>ПараметрыПечати.ДолгКредитора.Количество(),ПараметрыПечати.ДолгДебитора.Количество(),ПараметрыПечати.ДолгКредитора.Количество());
	Для ъ=1 По КоличествоСтрок Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		Если ъ <= ПараметрыПечати.ДолгДебитора.Количество() Тогда
			СтрокаТЗ=ПараметрыПечати.ДолгДебитора[ъ-1];
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, СтрокаТЗ);
		КонецЕсли;
		
		Если ъ <= ПараметрыПечати.ДолгКредитора.Количество() Тогда			
			СтрокаТЗ=ПараметрыПечати.ДолгКредитора[ъ-1];
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, СтрокаТЗ);
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;	
	
	ОбластьМакета=Макет.ПолучитьОбласть("ПодвалТЧ");
	ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ПараметрыПечати);
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета=Макет.ПолучитьОбласть("Подвал");
	ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ПараметрыПечати);
	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабДокумент;
КонецФункции	

Функция Печать(СтруктураПараметров, КоличествоЭкземпляров=1, НаПринтер=Ложь, ТабДокумент=Неопределено) Экспорт
	Если СтруктураПараметров.ИмяМакета="АктВзаимозачета" Тогда		
		ТабДокумент=Печать_АктВзаимозачета(СтруктураПараметров);

	ИначеЕсли СтруктураПараметров.ИмяМакета="УведомлениеОЗачете" Тогда		
		ТабДокумент=Печать_УведомлениеОЗачете(СтруктураПараметров);

	ИначеЕсли СтруктураПараметров.ИмяМакета="БухгалтерскаяСправка" Тогда
		ТабДокумент=ПечатныеФормыСервер.БухгалтерскаяСправка(СтруктураПараметров, "Хозрасчетный");		
	КонецЕсли;

	Возврат ТабДокумент;
КонецФункции
